#### Terraform Format and Style - `success`
#### Terraform Initialization - `success`
#### Terraform Plan - `success`          

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.remote["connectivity"]: Reading...
data.terraform_remote_state.remote["current"]: Reading...
module.landingzone.module.keyvaults["kv1"].azurecaf_name.keyvault (deposed object ebd8dc1f): Refreshing state... [id=ufryvxbipoaqufgv]
module.landingzone.module.mssql_databases["mssql_db1"].azurecaf_name.mssqldb: Refreshing state... [id=lfquoaqrckllwtfn]
module.landingzone.module.resource_groups["nonprod-rg"].azurecaf_name.rg: Refreshing state... [id=encvtbalmcijwore]
module.landingzone.module.managed_identities["nonprodapp_mi"].azurecaf_name.msi: Refreshing state... [id=kbknorvevjvcxmju]
module.landingzone.module.keyvaults["kv1"].azurecaf_name.keyvault: Refreshing state... [id=bjpgwcsjbjbsuncn]
module.landingzone.module.container_registry["acr1"].azurecaf_name.acr: Refreshing state... [id=mewmrugpsinwffvi]
data.terraform_remote_state.remote["connectivity"]: Read complete after 1s
data.terraform_remote_state.remote["current"]: Read complete after 2s
module.landingzone.data.azurerm_client_config.current: Reading...
module.landingzone.data.azurerm_subscription.primary: Reading...
module.landingzone.module.resource_groups["nonprod-rg"].azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg]
module.landingzone.data.azurerm_client_config.current: Read complete after 0s [id=2023-03-22 08:49:50.513945446 +0000 UTC]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Reading...
module.landingzone.data.azurerm_subscription.primary: Read complete after 0s [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0]
module.landingzone.data.azuread_service_principal.logged_in_app[0]: Read complete after 0s [id=2b3020e2-22c9-4b01-b88e-95624dbd2f23]
module.landingzone.module.networking["spoke_re1"].azurecaf_name.caf_name_vnet: Refreshing state... [id=vsbwiaityorqaftt]
module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurecaf_name.subnet: Refreshing state... [id=wcvevhjfqamunskd]
module.landingzone.module.managed_identities["nonprodapp_mi"].azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dvt_db_mi]
module.landingzone.module.networking["spoke_re1"].module.nsg.azurecaf_name.nsg_obj["aks_nodepool_system"]: Refreshing state... [id=mxqeovatikhvlfqr]
module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurecaf_name.subnet: Refreshing state... [id=gtgxigiqommvhyrq]
module.landingzone.module.networking["spoke_re1"].module.nsg.azurerm_network_security_group.nsg_obj["aks_nodepool_system"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/networkSecurityGroups/aks_nodepool_system]
module.landingzone.module.networking["spoke_re1"].azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks]
module.landingzone.module.networking["spoke_re1"].module.subnets["aks_nodepool_system"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system]
module.landingzone.module.networking["spoke_re1"].module.subnets["private_endpoints"].azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/private_endpoints]
module.landingzone.module.managed_identities["nonprodapp_mi"].time_sleep.propagate_to_azuread: Refreshing state... [id=2023-03-22T08:09:44Z]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2023-03-22 08:49:51.715944084 +0000 UTC]
module.landingzone.module.networking["spoke_re1"].azurerm_subnet_network_security_group_association.nsg_vnet_association["aks_nodepool_system"]: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system]
module.landingzone.module.keyvaults["kv1"].azurerm_key_vault.keyvault: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.KeyVault/vaults/dvtnonprodkeyvault]
module.landingzone.module.container_registry["acr1"].azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ContainerRegistry/registries/dvtnonprodacr]
module.landingzone.module.keyvaults["kv1"].module.initial_policy[0].module.managed_identity["managed_identity"].azurerm_key_vault_access_policy.policy: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.KeyVault/vaults/dvtnonprodkeyvault/objectId/22fb449f-78de-422b-bd9b-a2d7f4be9990]
module.landingzone.module.keyvaults["kv1"].module.initial_policy[0].module.logged_in_aad_app["logged_in_aad_app"].azurerm_key_vault_access_policy.policy: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.KeyVault/vaults/dvtnonprodkeyvault/objectId/2b3020e2-22c9-4b01-b88e-95624dbd2f23]
module.landingzone.module.mssql_servers["mssqlserver1"].random_password.sql_admin[0]: Refreshing state... [id=none]
module.landingzone.module.mssql_servers["mssqlserver1"].azurecaf_name.mssql: Refreshing state... [id=iefwqnqtxwsclbfq]
module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_key_vault_secret.sql_admin_password[0]: Refreshing state... [id=https://dvtnonprodkeyvault.vault.azure.net/secrets/nonprod-mssqlserver-password/083f9f1649ed4114811fede8843489e4]
module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_mssql_server.mssql: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Sql/servers/nonprod-mssqlserver]
module.landingzone.module.mssql_databases["mssql_db1"].azurerm_mssql_database.mssqldb: Refreshing state... [id=/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Sql/servers/nonprod-mssqlserver/databases/exampledb1]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.default_node_pool: Refreshing state... [id=fbcnysjesrxawdif]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.rg_node: Refreshing state... [id=cnexbeothfishvau]
module.landingzone.module.aks_clusters["aks_nonprod"].random_string.prefix: Refreshing state... [id=jrgpqwggqd]
module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.aks: Refreshing state... [id=frhcmdpetwarjjug]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.landingzone.module.mssql_servers["mssqlserver1"].azurerm_mssql_server.mssql has changed
  ~ resource "azurerm_mssql_server" "mssql" {
        id                                   = "/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Sql/servers/nonprod-mssqlserver"
        name                                 = "nonprod-mssqlserver"
        tags                                 = {
            "module" = "mssql_server"
        }
        # (11 unchanged attributes hidden)

      ~ identity {
          + user_assigned_identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.landingzone.module.aks_clusters["aks_nonprod"].azurecaf_name.rg_node must be replaced
-/+ resource "azurecaf_name" "rg_node" {
      ~ id            = "cnexbeothfishvau" -> (known after apply)
      ~ name          = "app-nonprod-rg" -> "app-nonprod-nodes-rg" # forces replacement
      ~ result        = "app-nonprod-rg" -> (known after apply)
      ~ results       = {} -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.landingzone.module.aks_clusters["aks_nonprod"].azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + azure_policy_enabled                = (known after apply)
      + dns_prefix                          = "jrgpqwggqd"
      + fqdn                                = (known after apply)
      + http_application_routing_enabled    = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + local_account_disabled              = false
      + location                            = "westeurope"
      + name                                = "akscluster-re1"
      + node_resource_group                 = (known after apply)
      + open_service_mesh_enabled           = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "app-nonprod-rg"
      + role_based_access_control_enabled   = (known after apply)
      + sku_tier                            = "Free"
      + tags                                = {
          + "module" = "aks"
        }

      + azure_active_directory_role_based_access_control {
          + azure_rbac_enabled = true
          + managed            = true
          + tenant_id          = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = false
          + enable_host_encryption       = false
          + enable_node_public_ip        = false
          + kubelet_disk_type            = (known after apply)
          + max_pods                     = 30
          + name                         = "sharedsvc"
          + node_count                   = 1
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = false
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 512
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + tags                         = {
              + "module"  = "aks"
              + "project" = "Non Prod Test Node Pool"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_F4s_v2"
          + vnet_subnet_id               = "/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.Network/virtualNetworks/aks/subnets/aks_nodepool_system"
        }

      + identity {
          + principal_id              = (known after apply)
          + tenant_id                 = (known after apply)
          + type                      = "UserAssigned"
          + user_assigned_identity_id = "/subscriptions/c1cbea85-2d1c-4f36-a6d7-636df95de7e0/resourceGroups/app-nonprod-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/dvt_db_mi"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "Standard"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)
        }
    }

  # module.landingzone.module.keyvaults["kv1"].azurecaf_name.keyvault (deposed object ebd8dc1f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "azurecaf_name" "keyvault" {
      - clean_input   = true -> null
      - id            = "ufryvxbipoaqufgv" -> null
      - name          = "nonprodkeyvault" -> null
      - passthrough   = true -> null
      - random_length = 3 -> null
      - resource_type = "azurerm_key_vault" -> null
      - result        = "nonprodkeyvault" -> null
      - results       = {} -> null
      - separator     = "-" -> null
      - use_slug      = false -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + objects         = (sensitive value)

Warning: Argument is deprecated

  with module.landingzone.module.api_management_custom_domain.azurerm_api_management_custom_domain.apim,
  on ../dvt-caf/modules/apim/api_management_custom_domain/module.tf line 1, in resource "azurerm_api_management_custom_domain" "apim":
   1: resource "azurerm_api_management_custom_domain" "apim" {

`proxy` is deprecated and will be renamed to `gateway` in version 3.0 of the
AzureRM provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelherik, Action: `pull_request`*